# About:
- Some basic analysis on the Titanic dataset using `pandas`

In [2]:
import pandas as pd

In [3]:
data_file = 'titanic_dataset.csv'

In [4]:
df = pd.read_csv(data_file)

In [5]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### Check if some of the useful-looking columns have null values:

In [13]:
for column in ['Fare', 'Survived', 'Pclass', 'Sex', 'Age']:
    null_count = df[column].isna().sum()
    print(f"{column:10s}: {null_count}")

Fare      : 0
Survived  : 0
Pclass    : 0
Sex       : 0
Age       : 177